In [2]:
import pandas as pd
import numpy as np

In [2]:
seq_data = range(10  55 10)
s = pd.Series(seq_data)

s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [4]:
s.values

array([10, 20, 30, 40, 50], dtype=int64)

In [7]:
s2 = pd.Series(['a'  'b'  'c'  1 2 3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [9]:
index_date = ['2018-10-07'  '2018-10-08'  '2018-10-09'  '2018-10-10']
s4 = pd.Series([200 195  np.nan  205]  index = index_date)
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

#### 날짜 자동생성 :  date_range

start는 시작날짜  end는 끝 날짜  periods는 날짜 데이터 생성기간  freq는 날짜 데이터 생성주기

In [11]:
pd.date_range(start = '2019-01-01'  end = '2019-01-07'  periods = None  freq = 'D')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

하루씩 증가하는 날짜!

In [3]:
pd.date_range(start = "2019-01-01"  periods = 4  freq = '2D')

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07'], dtype='datetime64[ns]', freq='2D')

In [5]:
pd.date_range(start = "2019-01-01"  periods = 5  freq = 'Q')

DatetimeIndex(['2019-03-31', '2019-06-30', '2019-09-30', '2019-12-31',
               '2020-03-31'],
              dtype='datetime64[ns]', freq='Q-DEC')

위는 쿼터! 총 다섯개의 분기가 나오게 된다. periods는 그냥 산출할 값의 개수라고 생각해도 될듯

In [6]:
pd.date_range(start = "2019-01-01 08:00"  periods = 10  freq = 'H')

DatetimeIndex(['2019-01-01 08:00:00', '2019-01-01 09:00:00',
               '2019-01-01 10:00:00', '2019-01-01 11:00:00',
               '2019-01-01 12:00:00', '2019-01-01 13:00:00',
               '2019-01-01 14:00:00', '2019-01-01 15:00:00',
               '2019-01-01 16:00:00', '2019-01-01 17:00:00'],
              dtype='datetime64[ns]', freq='H')

#### DataFrame을 이용한 데이터 생성

df = pd.DataFrame(data  [  index = index_data  columns = columns_data])

In [7]:
import pandas as pd
pd.DataFrame([[1 2 3]  [4 5 6]  [7 8 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
import pandas as pd
import numpy as np

data = np.array([[1 2 3]  [4 5 6]  [7 8 9]  [10 11 12]])
index_date = pd.date_range('2019-01-01'  periods = 4)
columns_list = ["a"  "b"  "c"]
pd.DataFrame(data = data   index = index_date  columns = columns_list)

             a   b   c
2019-01-01   1   2   3
2019-01-02   4   5   6
2019-01-03   7   8   9
2019-01-04  10  11  12

In [11]:
table_data = {
    '연도' : [2015  2016  2017  2017  2017] 
    '지사' : ['한국'  '한국'   '미국'  '한국'  '미국'] 
    '고객수' : [200 250 450 300 500]
}
table_data

{'연도': [2015, 2016, 2017, 2017, 2017],
 '지사': ['한국', '한국', '미국', '한국', '미국'],
 '고객수': [200, 250, 450, 300, 500]}

In [14]:
df = pd.DataFrame(table_data)
df

     연도  지사  고객수
0  2015  한국  200
1  2016  한국  250
2  2017  미국  450
3  2017  한국  300
4  2017  미국  500

In [15]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
df.columns

Index(['연도', '지사', '고객수'], dtype='object')

In [18]:
df.values

array([[2015, '한국', 200],
       [2016, '한국', 250],
       [2017, '미국', 450],
       [2017, '한국', 300],
       [2017, '미국', 500]], dtype=object)

- 이건 행별로 데이터를 보여주는 것 같다

### 데이터 연산

In [19]:
s3 = pd.Series([1 2 3 4])
s4 = pd.Series([10 20 30 40 50])
s3 + s4

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [20]:
s4 - s3

0     9.0
1    18.0
2    27.0
3    36.0
4     NaN
dtype: float64

- 연산 불가인 경우 NaN으로 뽑아준다

In [26]:
pd.DataFrame([[1 2 3 4 5]  [6 7 8 9 10]])

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

- **R과 다른점은 R은 칼럼을 우선으로 채우게 되는데 python은 행을 우선으로 채우게 된다.**
      만약 R에서 data.frame(c(1 2 3 4 5)  c(6 7 8 9 10))이라는 코드를 생성하면  두개의 칼럼이 생기게 될 것이다.

In [27]:
pd.DataFrame(
{ '0' : [1 2 3 4 5] 
 '1' : [6 7 8 9 10]
    
})

   0   1
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

만약 열 기준으로 데이터를 생성하고 싶다면 다음과 같이 진행하면 된다. 오히려 R보다 다양성을 지니는 것 같다

In [29]:
df1  = pd.DataFrame({
    'a' : [1 2 3 4 5] 
    'b' : [10 20 30 40 50] 
    'c' : [100 200 300 400 500]
})
df1

   a   b    c
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [30]:
df2  = pd.DataFrame({
    'a' : [6 7 8] 
    'b' : [60 70 80] 
    'c' : [600 700 800] 
})
df2

   a   b    c
0  6  60  600
1  7  70  700
2  8  80  800

In [31]:
df1 + df2

      a      b       c
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

2012~2016까지 우리나라 계절별 강수량

In [35]:
df3 = pd.DataFrame({'봄':  [256.5  264.3  215.9  223.2  312.8] 
              '여름': [770.6  567.5  599.8  387.1  446.2] 
              '가을': [363.5  231.2  293.1  247.7  381.6] 
              '겨울': [139.3  59.9  76.9  109.1  108.1]}  
columns = ['봄'  '여름'  '가을'  '겨울'] 
index = ['2012'  '2013'  '2014'  '2015'  '2016'])
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [38]:
df3.mean()
#칼럼별 평균을 뽑아주게 된다.

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [39]:
df3.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

- **axis = 0이면 열별로 연산을 수행하고 axis = 1이면 행별로 연산을 수행한다.**

In [40]:
print(df3.mean(axis = 0))
print(df3.mean(axis = 1))

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64
2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [44]:
print(df3.std(axis = 0))
print(df3.std(axis = 1))

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64
2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

- 기초통계량 확인 : describe method (= R의 summary)

In [45]:
df3.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

- 데이터의 구조 파악 : info method(=R의 str)

In [46]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 2012 to 2016
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   봄       5 non-null      float64
 1   여름      5 non-null      float64
 2   가을      5 non-null      float64
 3   겨울      5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

### 데이터 추출

2011년~2017년 노선별 KTX 이용자 수

In [77]:
import pandas as pd
import numpy as np

df_KTX = pd.DataFrame(
    data = {'경부선_KTX': [39060 , 39896 , 42005,  43621,  41702  ,41266  ,32427], 
            '호남선_KTX': [7313 , 6967 , 6873 , 6626 , 8675 , 10622,  9228] ,
            '경전선_KTX': [3627 , 4168  ,4088 , 4424,  4606 , 4984  ,5570] ,
            '전라선_KTX': [309 , 1771 , 1954 , 2244 , 3146,  3945,  5766] ,
            '동해선_KTX': [np.nan, np.nan,  np.nan , np.nan,  2395,  3786,  6667]} 
    ,
index = ['2011' , '2012',  '2013',  '2014' , '2015' , '2016'  ,'2017'])
df_KTX

      경부선_KTX  호남선_KTX  경전선_KTX  전라선_KTX  동해선_KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [53]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [54]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [55]:
df_KTX.values

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4168.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3786.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

In [58]:
df_KTX.head(2) #default = 5

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN

In [60]:
df_KTX.tail(2) #default = 5

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

- 행 선택하기

DataFrame_data[행시작위치 : 행끝위치] 

행시작위치부터 행끝위치-1 까지의 값을 반환한다 
행의 위치는 0부터 시작한다

In [63]:
df_KTX[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

index를 지정했다면  DataFrame_data.loc[index_name]으로 행을 불러올 수 있음.

In [64]:
df_KTX.loc['2013':'2016']

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

- 열 선택하기

칼럼 이름을 이용해 열을 선택하면 된다.

In [66]:
df_KTX['경부선_KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선 KTX, dtype: int64

하나의 열을 선택한 후 index의 범위를 지정해 원하는 데이터만 뽑아낼 수 있다.

In [80]:
df_KTX['경부선_KTX']['2012' : '2014']

2012    39896
2013    42005
2014    43621
Name: 경부선_KTX, dtype: int64

In [81]:
df_KTX['경부선_KTX'][1:4]

2012    39896
2013    42005
2014    43621
Name: 경부선_KTX, dtype: int64

#### **열과 행 더 멋있게 추출하기**

 - R처럼 행과 열을 자유롭게 추출하는 메서드는 iloc을 잘 사용하면 된다
 
-  이때 iloc은 index location의 줄임말

- loc는 col_names와 row_names를 활용하는 메서드

- iloc는 행의 index를 활용하여 추출하는 메서드라고 생각하면 될 것 같다

In [82]:
df_KTX.iloc[0:2  ,:]

      경부선_KTX  호남선_KTX  경전선_KTX  전라선_KTX  동해선_KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN

In [90]:
df_KTX.iloc[0:2 , 0:2]

      경부선_KTX  호남선_KTX
2011    39060     7313
2012    39896     6967

In [91]:
df_KTX.iloc[0:2,  [3, 2, 4]]

      전라선_KTX  경전선_KTX  동해선_KTX
2011      309     3627      NaN
2012     1771     4168      NaN

In [ ]:
- 위와 같은 방법으로 진행해주면 칼럼의 순서도 바꿔서 선택해줄 수 있다.

In [92]:
df_KTX.loc['2011':'2014'  "경부선_KTX":"경전선_KTX"]

      경부선_KTX  호남선_KTX  경전선_KTX
2011    39060     7313     3627
2012    39896     6967     4168
2013    42005     6873     4088
2014    43621     6626     4424

- **필터걸기(=R의 dplyr::filter)**

In [86]:
df_KTX[df_KTX.경부선_KTX >= 40000]

      경부선_KTX  호남선_KTX  경전선_KTX  전라선_KTX  동해선_KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

In [88]:
df_KTX[(df_KTX.경부선_KTX >= 40000) & (df_KTX.경전선_KTX >= 4500)]

      경부선_KTX  호남선_KTX  경전선_KTX  전라선_KTX  동해선_KTX
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

In [94]:
df_KTX[(df_KTX.경부선_KTX >= 40000) | (df_KTX.경전선_KTX >= 4500)].iloc[3:5,  :]

      경부선_KTX  호남선_KTX  경전선_KTX  전라선_KTX  동해선_KTX
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [167]:
#다양한 방식으로 필터를 걸 수 있다 
df_KTX.filter(like = "경", axis = 1) #"경"이라는 단어를 가진 칼럼을 추출

      경부선_KTX  경전선_KTX
2011    39060     3627
2012    39896     4168
2013    42005     4088
2014    43621     4424
2015    41702     4606
2016    41266     4984
2017    32427     5570

In [169]:
df_KTX.drop(df_KTX.index[[0,1]])

      경부선_KTX  호남선_KTX  경전선_KTX  전라선_KTX  동해선_KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [170]:
df_KTX #하지만 실제 데이터는 삭제되지 않는다.

      경부선_KTX  호남선_KTX  경전선_KTX  전라선_KTX  동해선_KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [172]:
df_KTX.drop('경전선_KTX', axis = 1)

      경부선_KTX  호남선_KTX  전라선_KTX  동해선_KTX
2011    39060     7313      309      NaN
2012    39896     6967     1771      NaN
2013    42005     6873     1954      NaN
2014    43621     6626     2244      NaN
2015    41702     8675     3146   2395.0
2016    41266    10622     3945   3786.0
2017    32427     9228     5766   6667.0

In [173]:
df_KTX #실제 데이터는 삭제되지 않는다.

      경부선_KTX  호남선_KTX  경전선_KTX  전라선_KTX  동해선_KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [175]:
import  cx_Oracle
conn = cx_Oracle.connect('hr/1234@127.0.0.1:1521/xe')
query = 'select * from employees'
df_emp = pd.read_sql(query, con = conn)
df_emp

DatabaseError: ORA-12541: TNS:no listener

- 위처럼 여러 조건을 걸어 filter를 쉽게 걸 수 있다는 것이 python의 장점인 것 같다

### 데이터 병합

#### row 기준 병합

- *DataFrame_data1.append(DataFrame_data2[ ignore_index = True])*

- R의 rbind와 같은 기능

- ignore_index를 해주면 붙이는 데이터의 index를 무시하고 새로운 index를 할당해준다

In [95]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({
    'class1' : [95  97 50 20] 
    'class2' : [70  70  58  76]
})
df1

   class1  class2
0      95      70
1      97      70
2      50      58
3      20      76

In [96]:
df2 = pd.DataFrame({
    'class1' : [97 89] 
    'class2' : [29 70]
})
df2

   class1  class2
0      97      29
1      89      70

In [97]:
df1.append(df2)

   class1  class2
0      95      70
1      97      70
2      50      58
3      20      76
0      97      29
1      89      70

In [99]:
df1.append(df2 , ignore_index= True) #이 기능을 사용해주면 새로운 인덱스를 할당해주게 된다.

   class1  class2
0      95      70
1      97      70
2      50      58
3      20      76
4      97      29
5      89      70

In [101]:
df3 = pd.DataFrame({
    'class3' : [1 2 3 4] 
    'class4' : [5 6 7 8]
})
df3

   class3  class4
0       1       5
1       2       6
2       3       7
3       4       8

In [103]:
df1.append(df3,  ignore_index=True) #이처럼 칼럼명이 다르면 결합되지 않는다.

   class1  class2  class3  class4
0    95.0    70.0     NaN     NaN
1    97.0    70.0     NaN     NaN
2    50.0    58.0     NaN     NaN
3    20.0    76.0     NaN     NaN
4     NaN     NaN     1.0     5.0
5     NaN     NaN     2.0     6.0
6     NaN     NaN     3.0     7.0
7     NaN     NaN     4.0     8.0

In [106]:
df3.columns = ['class1'  'class2'] #이렇게 칼럼명을 바꿔주고 결합하면 된다.
df1.append(df3,  ignore_index=True)

   class1  class2
0      95      70
1      97      70
2      50      58
3      20      76
4       1       5
5       2       6
6       3       7
7       4       8

In [107]:
df4 = pd.DataFrame({
    'class1' : [100 100]
})
df4

   class1
0     100
1     100

In [109]:
df1.append(df4 , ignore_index=True) #칼럼이 없는 경우는 이와 같이 NaN으로 해서 붙는다

   class1  class2
0      95    70.0
1      97    70.0
2      50    58.0
3      20    76.0
4     100     NaN
5     100     NaN

#### column 기준 병합

In [110]:
df4 = pd.DataFrame({
    'class3' : [93 91 95 96]
})
df4

   class3
0      93
1      91
2      95
3      96

In [111]:
df1.join(df4)

   class1  class2  class3
0      95      70      93
1      97      70      91
2      50      58      95
3      20      76      96

index의 크기가 다른 dataframe을 join을 사용하여 추가하면  데이터가 없는 부분은 NaN으로 채워진다

In [112]:
df5 = pd.DataFrame({'class4' : [82 94]})
df5

   class4
0      82
1      94

In [113]:
df1.join(df5)

   class1  class2  class4
0      95      70    82.0
1      97      70    94.0
2      50      58     NaN
3      20      76     NaN

index기준으로 채워지는 걸까? index를 달리 해보자

In [125]:
df6 = pd.DataFrame({
    'class3' : [93 91 95 96]} 
    index = range(1,5)
)
df6

   class3
1      93
2      91
3      95
4      96

In [126]:
df1.join(df6)

   class1  class2  class3
0      95      70     NaN
1      97      70    93.0
2      50      58    91.0
3      20      76    95.0

- 결과적으로 index가 같아야 붙는 것을 볼 수 있다! 약간 진짜 join 느낌으로 생각할 수 있을 듯 싶다.

- 그렇다면 index가 중복이라면 중복으로 join되는 건가?

In [129]:
df7 = pd.DataFrame({
     'class3' : [93, 91, 95, 96]} 
    index = [1, 2, 2, 3]
)
df7

   class3
1      93
2      91
2      95
3      96

In [130]:
df1.join(df7)

   class1  class2  class3
0      95      70     NaN
1      97      70    93.0
2      50      58    91.0
2      50      58    95.0
3      20      76    96.0

- 그렇다    이름이 join 이어서 뭔가 이상하긴 했었다. 만약 아무 인자를 넣지 않는다면 index를 기준으로 join된다고 생각하면 될 것 같다

#### 특정 Column 기준 병합

- merge라는 함수를 사용

In [134]:
df_left = pd.DataFrame({
    'key' : ['a'  'b'  'c'] 
    'left' : [1 2 3]
})
df_left

  key  left
0   a     1
1   b     2
2   c     3

In [136]:
df_right = pd.DataFrame({
    'key' : ['a'  'b'  'd'] 
    'right' : [4 5 6]
})
df_right

  key  right
0   a      4
1   b      5
2   d      6

In [137]:
df_left.merge(df_right  how = 'left'  on = 'key') #key를 기준으로 left join하라

  key  left  right
0   a     1    4.0
1   b     2    5.0
2   c     3    NaN

In [138]:
df_left.merge(df_right  how = 'right'  on = 'key') #key를 기준으로 right join하라

  key  left  right
0   a   1.0      4
1   b   2.0      5
2   d   NaN      6

In [139]:
df_left.merge(df_right  how = 'outer'  on = 'key') #key를 기준으로 outer join하라

  key  left  right
0   a   1.0    4.0
1   b   2.0    5.0
2   c   3.0    NaN
3   d   NaN    6.0

In [140]:
df_left.merge(df_right  how = 'inner'  on = 'key') #key를 기준으로 inner join하라

  key  left  right
0   a     1      4
1   b     2      5

### 데이터 Read

#### 표 형식의 데이터 Read

-  read_csv()를 이용해 데이터를 불러온다.

- *dataframe_Data = pd.read_csv(file_name [  options])*

In [142]:
%%writefile C:\python\data\sea_rain1.csv
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Writing C:\python\data\sea_rain1.csv

In [147]:
import pandas as pd

pd.read_csv('C:\python\data\sea_rain1.csv'  encoding = 'utf-8')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [149]:
pd.read_csv('C:\python\data\sea_rain1.csv'  encoding = 'cp949') #인코딩을 잘못 넣어주면 다음과 같이 에러 발생

UnicodeDecodeError: 'cp949' codec can't decode byte 0xec in position 0: illegal multibyte sequence

- 데이터가 csv처럼 콤마로 구분된 데이터가 아니라  다른 구분자로 이루어져 있다면?

- sep = 옵션을 사용하면 된다

In [151]:
%%writefile C:\python\data\sea_rain1_space.txt
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Writing C:\python\data\sea_rain1_space.txt

In [152]:
pd.read_csv('C:\python\data\sea_rain1_space.txt', sep = ' ')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

특정 칼럼을 index로 설정할 수 있다

In [153]:
pd.read_csv('C:\python\data\sea_rain1_space.txt', sep = ' ', index_col="연도")

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

#### 표 형식의 데이터 -> 파일

- *DataFrame_data.to_csv(file_name[, options])*

In [155]:
df_WH = pd.DataFrame({'Weight':[62, 67, 55, 74],
                      'Height':[165, 177, 160, 180]},
                       index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'user' #이렇게 index칼럼의 이름을 붙인다
df_WH

      Weight  Height
user
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [157]:
df_WH['bmi'] = df_WH['Weight'] / (df_WH['Height']/100)**2
df_WH

      Weight  Height        bmi
user
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [159]:
df_WH.to_csv('C:/python/data/bmi.csv')

- 이상하게 저장할 땐 슬래쉬를 사용하고, 불러올 땐 역슬래쉬를 사용한다

In [160]:
!type C:\python\data\bmi.csv

user,Weight,Height,bmi
ID_1,62,165,22.77318640955005
ID_2,67,177,21.38593635289987
ID_3,55,160,21.484374999999996
ID_4,74,180,22.839506172839506

In [161]:
#공백으로 구분처리 된 데이터를 생성 
df_pr = pd.DataFrame({'판매가격':[2000, 3000, 5000, 10000],
                       '판매량':[32, 53, 40, 25]},
                       index=['P1001', 'P1002', 'P1003', 'P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [162]:
df_pr.to_csv('C:/python/data/price.txt', sep = ' ', encoding = 'cp949')

In [164]:
!type c:\python\data\price.txt

제품번호 판매가격 판매량
P1001 2000 32
P1002 3000 53
P1003 5000 40
P1004 10000 25

In [165]:
ddd

NameError: name 'ddd' is not defined